000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ЗагрузкаПлановПродаж/ЗагрузкаПлановПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПлановПродаж</name>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ПланыПродаж/ПланыПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланыПродаж</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ПланыПродажВзвешенные/ПланыПродажВзвешенные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланыПродажВзвешенные</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Основная организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>EnumRef.ВариантыВеденияДополнительныхДанныхПоНоменклатуре</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКоличествоСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНомерСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристик</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаИспользованияСерий</name>
    <type>
      <types>EnumRef.НастройкиИспользованияСерийНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьУказанияСрокаГодностиСерии</name>
    <type>
      <types>EnumRef.ТочностиУказанияСрокаГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГарантии</name>
    <comment>Срок гарантии (мес.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолитикиУчетаСерий</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолитикаУчетаСерий</name>
      <type>
        <types>CatalogRef.ПолитикиУчетаСерий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ЗагрузкаПлановПродаж/Forms/ФормаЗагрузкиВзвешенный/Module.bsl
&НаСервере
Процедура ЗанестиДанныеВРегистр(КодМагазина,ПРОЕКТ,ДАТА,Сумма,Взвешенный)
	
	
	КодМагазина = Число(КодМагазина);
	Магазин =  Справочники.Магазины.НайтиПоРеквизиту("НомерМагазина",КодМагазина); 
	Если не Магазин=Справочники.Магазины.ПустаяСсылка() Тогда
		Если НЕ Взвешенный тогда
			НовыйПлан = РегистрыСведений.ПланыПродаж.СоздатьНаборЗаписей();
		Иначе
			НовыйПлан = РегистрыСведений.ПланыПродажВзвешенные.СоздатьНаборЗаписей();
		КонецЕсли;
		//НовыйПлан.Период=НачалоМесяца(ДатаЗагрузки);
		НовыйПлан.Отбор.Магазин.Установить(Магазин);  
		НовыйПлан.Отбор.Период.Установить(НачалоДня(ДАТА));
		Проект = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("IDN",ПРОЕКТ);
		НовыйПлан.Отбор.ПРОЕКТ.Установить(Проект);
		//НовыйПлан.Магазин=Магазин;
		
		Если ЗначениеЗаполнено(Проект) Тогда
			попытка
				ЗаписьГигиена =  НовыйПлан.Добавить();
				ЗаписьГигиена.Магазин = Магазин;
				ЗаписьГигиена.Период = НачалоДня(ДАТА);
				ЗаписьГигиена.Проект = Проект;
				ЗаписьГигиена.Сумма=Сумма;
				//СуммаПлана=СуммаПлана+Число(ГИГИЕНА);
				ЗаписьГигиена.Активность = Истина;
			Исключение
				Сообщить("ОШИБКА Проект "+ПРОЕКТ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		
			//попытка
			//	НовыйПлан.Сумма=Число(СуммаПлана);
			//Исключение
			//	Сообщить("ОШИБКА СуммаПлана "+Строка(СуммаПлана)+" "+КодМагазина);
			//КонецПопытки;
			попытка		
				НовыйПлан.Записать(Истина);
			исключение
				Сообщить("не удалось записать магазин - "+ КодМагазина);

			КонецПопытки
	Иначе
		Сообщить("не найден магазин - "+ КодМагазина);
	Конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьТаблицу(Команда)
	ошибка=ложь;
	НомерСтроки=2;
	
		

	КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
	ДатаСтрока = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+1).Текст;	
//пока ЗначениеЗаполнено(КодМагазина) цикл
пока  КодМагазина<>"" И  ДатаСтрока<>"" цикл 
	//НомерСтроки=НомерСтроки+1;
		ДатаСтрока = ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+1).Текст;
		КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(Формат(НомерСтроки,"ЧГ="),"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		ПРОЕКТ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(Формат(НомерСтроки,"ЧГ="),"ЧГ=")+"C"+Формат(3,"ЧГ=")).Текст)," ","");
		ДАТА = ПривестиКТипуДата(ДатаСтрока);
		Сумма = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(Формат(НомерСтроки,"ЧГ="),"ЧГ=")+"C"+Формат(4,"ЧГ=")).Текст)," ","");
		Если ЗначениеЗаполнено(КодМагазина) Тогда
			ЗанестиДанныеВРегистр(КодМагазина,ПРОЕКТ,ДАТА,Число(Сумма),Взвешенный);
			Состояние(Строка(НомерСтроки));	
		конецесли;
		
		НомерСтроки=НомерСтроки+1;
		
		//КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		обработкапрерыванияпользователя();
		
	конеццикла;
    ПоказатьПредупреждение(, "Данные загружены");	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаЗагрузки = НачалоМесяца(текущаядата());
КонецПроцедуры


&НаСервере
Функция ПривестиКТипуДата(СтрДата)
    День = Сред(СтрДата, 1, 2);
    Месяц = Сред(СтрДата, 4, 2);
    Год = Сред(СтрДата, 7, 4);
    Возврат(Дата(Год+Месяц+День));
КонецФункции

&НаКлиенте
Процедура ВзешенныйПриИзменении(Элемент)
	ВзешенныйПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВзешенныйПриИзмененииНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ВставитьОбласть(ТабличныйДокумент.Область("ОбластьШапка"));
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.ВставитьОбласть(ТабДок.Область("ОбластьШапка"),ТабличныйДокумент.Область(1,1));
КонецПроцедуры
